homework/Lab05-06/combustorSprayWallFilmReitzKHRT450/constant/cloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       dictionary;
    object      cloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type        sprayCloud;

solution
{
    active                      true;
    coupled                     true;
    transient                   yes;
    cellValueSourceCorrection   on;
    maxCo                       0.3;

    sourceTerms
    {
        schemes
        {
            rho         explicit 1;
            U           explicit 1;
            Yi          explicit 1;
            h           explicit 1;
            radiation   explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        thermo:mu       cell;
        T               cell;
        Cp              cell;
        kappa           cell;
        p               cell;
    }

    integrationSchemes
    {
        U   Euler;
        T   analytical;
    }
}

// n-Heptane
constantProperties
{ 
    T0              320;  

    // place holders for rho0 and Cp0
    // - reset from liquid properties using T0
    rho0            680;
    Cp0             2304;

    constantVolume  false;
}


subModels
{
    particleForces
    {
        sphereDrag;
    }

    injectionModels
    {
        injector-Assignment 
        {
            // injector type
            type                coneInjection;
            massTotal           1e-04;
            // flow rate profile 
            parcelBasisType     mass;
            injectionMethod     disc;
            flowType            flowRateAndDischarge;
            // injector geometry
            dInner              0.0;
            dOuter              1.9e-4;
            // injector time 
            SOI                 0.0;
            duration            0.1;
            // injector position and direction
            position            (0.0 -0.295 0.0);
            direction           (0.0  1.0   0.0);
            // parcel flow 
            parcelsPerSecond    2e+5;
            // flow rate 
            flowRateProfile     sine; 
            amplitude           1;      
            frequency           5; 
            level               0; 
            scale               1;             

            //- discharge coefficient: U = Vdot/(A*Cd)
            Cd              constant 0.9;

            // cone angle
            thetaInner      constant 0.0;
            thetaOuter      constant 10.0;

            sizeDistribution
            {
                type    RosinRammler;
                // alternatives:
                // - exponential
                // - fixedValue
                // - general (tabulated)
                // - normal
                // - uniform
                // - multinormal

                RosinRammlerDistribution
                {
                    minValue    1e-06;
                    maxValue    0.00015;
                    d           0.00015;
                    n           3;
                }
            }
        }
    }

    // ----------------------------------------------------------------
    // DISPERSION MODEL turbulence/submodels/Kinematic/DispersionModel
    // dispersionRASModel, gradientDispersionRAS, stochasticDispersionRAS
    dispersionModel             none;

    patchInteractionModel       standardWallInteraction;

    heatTransferModel           RanzMarshall;

    compositionModel            singlePhaseMixture;

    phaseChangeModel            liquidEvaporationBoil;

    surfaceFilmModel            thermoSurfaceFilm;

    atomisationModel            none;

    breakupModel                ReitzDiwakar; 

    stochasticCollisionModel    none;

    radiation                   off;

    standardWallInteractionCoeffs
    {
        type   rebound;
        e      1;       // optional - elasticity coeff
        mu     0;       // optional - restitution coeff
    }

    RanzMarshallCoeffs
    {
        BirdCorrection  true;
    }

    singlePhaseMixtureCoeffs
    {
        phases
        (
            liquid
            {
                C7H16   1;
            }
        );
    }

    liquidEvaporationBoilCoeffs
    {
        enthalpyTransfer enthalpyDifference;

        activeLiquids    ( C7H16 );
    }

    ReitzDiwakarCoeffs
    {
        solveOscillationEq  yes;
        Cbag                6;
        Cb                  0.785;
        Cstrip              0.5;
        Cs                  10;
    }

    TABCoeffs
    {
        y0              0;
        yDot0           0;
        Cmu             10;
        Comega          8;
        WeCrit          12;
    }

    thermoSurfaceFilmCoeffs
    {
        interactionType splashBai;
        deltaWet        0.0005;
        Adry            2630;
        Awet            1320;
        Cf              0.6;
    }
}

// ------------------------------------------------------------------------
// CLOUD FUNCTION OBJECTS: intermediate/submodels/CloudFunctionObjects

cloudFunctions
{
    // function objects:
    //  + FacePostProcessing
    //  + ParticleCollector
    //  + ParticleErosion
    //  + ParticleTracks
    //  + ParticleTrap
    //  + PatchPostProcessing
    //  + VoidFraction
}

// ************************************************************************* //
