homework/Lab05-06/combustorSprayWallFilmReitzKHRT450/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                     
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
        tolerance       1e-07;
        relTol          0;
    }
    
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        relTol 0;
    }    
    
    "(U|k|epsilon|h)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;

    }

    ".*Final"
    {
        $U;
        relTol          0;
    }

    "(Yi|O2|N2|H2O).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors 3;
    nOuterCorrectors 500;
    nNonOrthogonalCorrectors 0;
    consistent no;
    turbOnFinalIterOnly no;
    
    outerCorrectorResidualControl
    {
        p 
        {
            tolerance 1e-3;
            relTol 0;
        }

        U 
        {
            tolerance 1e-4;
            relTol 0;
        }

    }

}

relaxationFactors
{
    fields
    {
        "p.*"         0.3;
    }

    equations
    {
        "U.*"         0.7;
        "(k|epsilon)" 0.5;
        "(h|e)"       0.5;
    }
}

// ************************************************************************* //
